Service/Service/DeleteUser_HardDelete.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteUser xmlns="http://www.tavisca.com/Vexiere/IUser/2013/01">
      <deleteUserRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:IsHardDelete>true</a:IsHardDelete>
        <a:UserIdentifier i:type="a:IdBasedUserIdentifier">
          <a:Id>131</a:Id>
        </a:UserIdentifier>
      </deleteUserRequest>
    </DeleteUser>
  </s:Body>
</s:Envelope>